ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153fxx_ca7.h
/****************  Bit definition for DDRCTRL_INIT3 register  *****************/
#define DDRCTRL_INIT3_EMR_Pos (0U)
#define DDRCTRL_INIT3_EMR_Msk (0xFFFFU << DDRCTRL_INIT3_EMR_Pos) /*!< 0x0000FFFF */
#define DDRCTRL_INIT3_EMR     DDRCTRL_INIT3_EMR_Msk              /*!< DDR2: Value to write to EMR register. Bits 9:7 are for OCD and the setting in this register is ignored. The DDRCTRL sets those bits appropriately. */
#define DDRCTRL_INIT3_EMR_0   (0x1U << DDRCTRL_INIT3_EMR_Pos)    /*!< 0x00000001 */
#define DDRCTRL_INIT3_EMR_1   (0x2U << DDRCTRL_INIT3_EMR_Pos)    /*!< 0x00000002 */
#define DDRCTRL_INIT3_EMR_2   (0x4U << DDRCTRL_INIT3_EMR_Pos)    /*!< 0x00000004 */
#define DDRCTRL_INIT3_EMR_3   (0x8U << DDRCTRL_INIT3_EMR_Pos)    /*!< 0x00000008 */
#define DDRCTRL_INIT3_EMR_4   (0x10U << DDRCTRL_INIT3_EMR_Pos)   /*!< 0x00000010 */
#define DDRCTRL_INIT3_EMR_5   (0x20U << DDRCTRL_INIT3_EMR_Pos)   /*!< 0x00000020 */
#define DDRCTRL_INIT3_EMR_6   (0x40U << DDRCTRL_INIT3_EMR_Pos)   /*!< 0x00000040 */
#define DDRCTRL_INIT3_EMR_7   (0x80U << DDRCTRL_INIT3_EMR_Pos)   /*!< 0x00000080 */
#define DDRCTRL_INIT3_EMR_8   (0x100U << DDRCTRL_INIT3_EMR_Pos)  /*!< 0x00000100 */
#define DDRCTRL_INIT3_EMR_9   (0x200U << DDRCTRL_INIT3_EMR_Pos)  /*!< 0x00000200 */
#define DDRCTRL_INIT3_EMR_10  (0x400U << DDRCTRL_INIT3_EMR_Pos)  /*!< 0x00000400 */
#define DDRCTRL_INIT3_EMR_11  (0x800U << DDRCTRL_INIT3_EMR_Pos)  /*!< 0x00000800 */
#define DDRCTRL_INIT3_EMR_12  (0x1000U << DDRCTRL_INIT3_EMR_Pos) /*!< 0x00001000 */
#define DDRCTRL_INIT3_EMR_13  (0x2000U << DDRCTRL_INIT3_EMR_Pos) /*!< 0x00002000 */
#define DDRCTRL_INIT3_EMR_14  (0x4000U << DDRCTRL_INIT3_EMR_Pos) /*!< 0x00004000 */
#define DDRCTRL_INIT3_EMR_15  (0x8000U << DDRCTRL_INIT3_EMR_Pos) /*!< 0x00008000 */
#define DDRCTRL_INIT3_MR_Pos  (16U)
#define DDRCTRL_INIT3_MR_Msk  (0xFFFFU << DDRCTRL_INIT3_MR_Pos)  /*!< 0xFFFF0000 */
#define DDRCTRL_INIT3_MR      DDRCTRL_INIT3_MR_Msk               /*!< DDR2: Value to write to MR register. Bit 8 is for DLL and the setting here is ignored. The DDRCTRL sets this bit appropriately. */
#define DDRCTRL_INIT3_MR_0    (0x1U << DDRCTRL_INIT3_MR_Pos)     /*!< 0x00010000 */
#define DDRCTRL_INIT3_MR_1    (0x2U << DDRCTRL_INIT3_MR_Pos)     /*!< 0x00020000 */
#define DDRCTRL_INIT3_MR_2    (0x4U << DDRCTRL_INIT3_MR_Pos)     /*!< 0x00040000 */
#define DDRCTRL_INIT3_MR_3    (0x8U << DDRCTRL_INIT3_MR_Pos)     /*!< 0x00080000 */
#define DDRCTRL_INIT3_MR_4    (0x10U << DDRCTRL_INIT3_MR_Pos)    /*!< 0x00100000 */
#define DDRCTRL_INIT3_MR_5    (0x20U << DDRCTRL_INIT3_MR_Pos)    /*!< 0x00200000 */
#define DDRCTRL_INIT3_MR_6    (0x40U << DDRCTRL_INIT3_MR_Pos)    /*!< 0x00400000 */
#define DDRCTRL_INIT3_MR_7    (0x80U << DDRCTRL_INIT3_MR_Pos)    /*!< 0x00800000 */
#define DDRCTRL_INIT3_MR_8    (0x100U << DDRCTRL_INIT3_MR_Pos)   /*!< 0x01000000 */
#define DDRCTRL_INIT3_MR_9    (0x200U << DDRCTRL_INIT3_MR_Pos)   /*!< 0x02000000 */
#define DDRCTRL_INIT3_MR_10   (0x400U << DDRCTRL_INIT3_MR_Pos)   /*!< 0x04000000 */
#define DDRCTRL_INIT3_MR_11   (0x800U << DDRCTRL_INIT3_MR_Pos)   /*!< 0x08000000 */
#define DDRCTRL_INIT3_MR_12   (0x1000U << DDRCTRL_INIT3_MR_Pos)  /*!< 0x10000000 */
#define DDRCTRL_INIT3_MR_13   (0x2000U << DDRCTRL_INIT3_MR_Pos)  /*!< 0x20000000 */
#define DDRCTRL_INIT3_MR_14   (0x4000U << DDRCTRL_INIT3_MR_Pos)  /*!< 0x40000000 */
#define DDRCTRL_INIT3_MR_15   (0x8000U << DDRCTRL_INIT3_MR_Pos)  /*!< 0x80000000 */

/****************  Bit definition for DDRCTRL_INIT4 register  *****************/
#define DDRCTRL_INIT4_EMR3_Pos (0U)
#define DDRCTRL_INIT4_EMR3_Msk (0xFFFFU << DDRCTRL_INIT4_EMR3_Pos) /*!< 0x0000FFFF */
#define DDRCTRL_INIT4_EMR3     DDRCTRL_INIT4_EMR3_Msk              /*!< DDR2: Value to write to EMR3 register. */
#define DDRCTRL_INIT4_EMR3_0   (0x1U << DDRCTRL_INIT4_EMR3_Pos)    /*!< 0x00000001 */
#define DDRCTRL_INIT4_EMR3_1   (0x2U << DDRCTRL_INIT4_EMR3_Pos)    /*!< 0x00000002 */
#define DDRCTRL_INIT4_EMR3_2   (0x4U << DDRCTRL_INIT4_EMR3_Pos)    /*!< 0x00000004 */
#define DDRCTRL_INIT4_EMR3_3   (0x8U << DDRCTRL_INIT4_EMR3_Pos)    /*!< 0x00000008 */
#define DDRCTRL_INIT4_EMR3_4   (0x10U << DDRCTRL_INIT4_EMR3_Pos)   /*!< 0x00000010 */
#define DDRCTRL_INIT4_EMR3_5   (0x20U << DDRCTRL_INIT4_EMR3_Pos)   /*!< 0x00000020 */
#define DDRCTRL_INIT4_EMR3_6   (0x40U << DDRCTRL_INIT4_EMR3_Pos)   /*!< 0x00000040 */
#define DDRCTRL_INIT4_EMR3_7   (0x80U << DDRCTRL_INIT4_EMR3_Pos)   /*!< 0x00000080 */
#define DDRCTRL_INIT4_EMR3_8   (0x100U << DDRCTRL_INIT4_EMR3_Pos)  /*!< 0x00000100 */
#define DDRCTRL_INIT4_EMR3_9   (0x200U << DDRCTRL_INIT4_EMR3_Pos)  /*!< 0x00000200 */
#define DDRCTRL_INIT4_EMR3_10  (0x400U << DDRCTRL_INIT4_EMR3_Pos)  /*!< 0x00000400 */
#define DDRCTRL_INIT4_EMR3_11  (0x800U << DDRCTRL_INIT4_EMR3_Pos)  /*!< 0x00000800 */
#define DDRCTRL_INIT4_EMR3_12  (0x1000U << DDRCTRL_INIT4_EMR3_Pos) /*!< 0x00001000 */
#define DDRCTRL_INIT4_EMR3_13  (0x2000U << DDRCTRL_INIT4_EMR3_Pos) /*!< 0x00002000 */
#define DDRCTRL_INIT4_EMR3_14  (0x4000U << DDRCTRL_INIT4_EMR3_Pos) /*!< 0x00004000 */
#define DDRCTRL_INIT4_EMR3_15  (0x8000U << DDRCTRL_INIT4_EMR3_Pos) /*!< 0x00008000 */
#define DDRCTRL_INIT4_EMR2_Pos (16U)
#define DDRCTRL_INIT4_EMR2_Msk (0xFFFFU << DDRCTRL_INIT4_EMR2_Pos) /*!< 0xFFFF0000 */
#define DDRCTRL_INIT4_EMR2     DDRCTRL_INIT4_EMR2_Msk              /*!< DDR2: Value to write to EMR2 register. */
#define DDRCTRL_INIT4_EMR2_0   (0x1U << DDRCTRL_INIT4_EMR2_Pos)    /*!< 0x00010000 */
#define DDRCTRL_INIT4_EMR2_1   (0x2U << DDRCTRL_INIT4_EMR2_Pos)    /*!< 0x00020000 */
#define DDRCTRL_INIT4_EMR2_2   (0x4U << DDRCTRL_INIT4_EMR2_Pos)    /*!< 0x00040000 */
#define DDRCTRL_INIT4_EMR2_3   (0x8U << DDRCTRL_INIT4_EMR2_Pos)    /*!< 0x00080000 */
#define DDRCTRL_INIT4_EMR2_4   (0x10U << DDRCTRL_INIT4_EMR2_Pos)   /*!< 0x00100000 */
#define DDRCTRL_INIT4_EMR2_5   (0x20U << DDRCTRL_INIT4_EMR2_Pos)   /*!< 0x00200000 */
#define DDRCTRL_INIT4_EMR2_6   (0x40U << DDRCTRL_INIT4_EMR2_Pos)   /*!< 0x00400000 */
#define DDRCTRL_INIT4_EMR2_7   (0x80U << DDRCTRL_INIT4_EMR2_Pos)   /*!< 0x00800000 */
#define DDRCTRL_INIT4_EMR2_8   (0x100U << DDRCTRL_INIT4_EMR2_Pos)  /*!< 0x01000000 */
#define DDRCTRL_INIT4_EMR2_9   (0x200U << DDRCTRL_INIT4_EMR2_Pos)  /*!< 0x02000000 */
#define DDRCTRL_INIT4_EMR2_10  (0x400U << DDRCTRL_INIT4_EMR2_Pos)  /*!< 0x04000000 */
#define DDRCTRL_INIT4_EMR2_11  (0x800U << DDRCTRL_INIT4_EMR2_Pos)  /*!< 0x08000000 */
#define DDRCTRL_INIT4_EMR2_12  (0x1000U << DDRCTRL_INIT4_EMR2_Pos) /*!< 0x10000000 */
#define DDRCTRL_INIT4_EMR2_13  (0x2000U << DDRCTRL_INIT4_EMR2_Pos) /*!< 0x20000000 */
#define DDRCTRL_INIT4_EMR2_14  (0x4000U << DDRCTRL_INIT4_EMR2_Pos) /*!< 0x40000000 */
#define DDRCTRL_INIT4_EMR2_15  (0x8000U << DDRCTRL_INIT4_EMR2_Pos) /*!< 0x80000000 */

