ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153fxx_ca7.h
/***************  Bit definition for DDRCTRL_DFIMISC register  ****************/
#define DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN_Pos (0U)
#define DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN_Msk (0x1U << DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN_Pos) /*!< 0x00000001 */
#define DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN     DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN_Msk           /*!< PHY initialization complete enable signal. */
#define DDRCTRL_DFIMISC_CTL_IDLE_EN_Pos          (4U)
#define DDRCTRL_DFIMISC_CTL_IDLE_EN_Msk          (0x1U << DDRCTRL_DFIMISC_CTL_IDLE_EN_Pos)          /*!< 0x00000010 */
#define DDRCTRL_DFIMISC_CTL_IDLE_EN              DDRCTRL_DFIMISC_CTL_IDLE_EN_Msk                    /*!< Enables support of ctl_idle signal */
#define DDRCTRL_DFIMISC_DFI_INIT_START_Pos       (5U)
#define DDRCTRL_DFIMISC_DFI_INIT_START_Msk       (0x1U << DDRCTRL_DFIMISC_DFI_INIT_START_Pos)       /*!< 0x00000020 */
#define DDRCTRL_DFIMISC_DFI_INIT_START           DDRCTRL_DFIMISC_DFI_INIT_START_Msk                 /*!< PHY init start request signal.When asserted it triggers the PHY init start request */
#define DDRCTRL_DFIMISC_DFI_FREQUENCY_Pos        (8U)
#define DDRCTRL_DFIMISC_DFI_FREQUENCY_Msk        (0x1FU << DDRCTRL_DFIMISC_DFI_FREQUENCY_Pos)       /*!< 0x00001F00 */
#define DDRCTRL_DFIMISC_DFI_FREQUENCY            DDRCTRL_DFIMISC_DFI_FREQUENCY_Msk                  /*!< Indicates the operating frequency of the system. The number of supported frequencies and the mapping of signal values to clock frequencies are defined by the PHY. */
#define DDRCTRL_DFIMISC_DFI_FREQUENCY_0          (0x1U << DDRCTRL_DFIMISC_DFI_FREQUENCY_Pos)        /*!< 0x00000100 */
#define DDRCTRL_DFIMISC_DFI_FREQUENCY_1          (0x2U << DDRCTRL_DFIMISC_DFI_FREQUENCY_Pos)        /*!< 0x00000200 */
#define DDRCTRL_DFIMISC_DFI_FREQUENCY_2          (0x4U << DDRCTRL_DFIMISC_DFI_FREQUENCY_Pos)        /*!< 0x00000400 */
#define DDRCTRL_DFIMISC_DFI_FREQUENCY_3          (0x8U << DDRCTRL_DFIMISC_DFI_FREQUENCY_Pos)        /*!< 0x00000800 */
#define DDRCTRL_DFIMISC_DFI_FREQUENCY_4          (0x10U << DDRCTRL_DFIMISC_DFI_FREQUENCY_Pos)       /*!< 0x00001000 */

/***************  Bit definition for DDRCTRL_DFISTAT register  ****************/
#define DDRCTRL_DFISTAT_DFI_INIT_COMPLETE_Pos (0U)
#define DDRCTRL_DFISTAT_DFI_INIT_COMPLETE_Msk (0x1U << DDRCTRL_DFISTAT_DFI_INIT_COMPLETE_Pos) /*!< 0x00000001 */
#define DDRCTRL_DFISTAT_DFI_INIT_COMPLETE     DDRCTRL_DFISTAT_DFI_INIT_COMPLETE_Msk           /*!< The status flag register which announces when the DFI initialization has been completed. The DFI INIT triggered by dfi_init_start signal and then the dfi_init_complete flag is polled to know when the initialization is done. */
#define DDRCTRL_DFISTAT_DFI_LP_ACK_Pos        (1U)
#define DDRCTRL_DFISTAT_DFI_LP_ACK_Msk        (0x1U << DDRCTRL_DFISTAT_DFI_LP_ACK_Pos)        /*!< 0x00000002 */
#define DDRCTRL_DFISTAT_DFI_LP_ACK            DDRCTRL_DFISTAT_DFI_LP_ACK_Msk                  /*!< Stores the value of the dfi_lp_ack input to the controller. */

/**************  Bit definition for DDRCTRL_DFIPHYMSTR register  **************/
#define DDRCTRL_DFIPHYMSTR_DFI_PHYMSTR_EN_Pos (0U)
#define DDRCTRL_DFIPHYMSTR_DFI_PHYMSTR_EN_Msk (0x1U << DDRCTRL_DFIPHYMSTR_DFI_PHYMSTR_EN_Pos) /*!< 0x00000001 */
#define DDRCTRL_DFIPHYMSTR_DFI_PHYMSTR_EN     DDRCTRL_DFIPHYMSTR_DFI_PHYMSTR_EN_Msk           /*!< Enables the PHY Master Interface: */

/***************  Bit definition for DDRCTRL_ADDRMAP1 register  ***************/
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_Pos (0U)
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_Msk (0x3FU << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_Pos) /*!< 0x0000003F */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0     DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_Msk            /*!< Selects the HIF address bits used as bank address bit 0. */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_0   (0x1U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_Pos)  /*!< 0x00000001 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_1   (0x2U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_Pos)  /*!< 0x00000002 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_2   (0x4U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_Pos)  /*!< 0x00000004 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_3   (0x8U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_Pos)  /*!< 0x00000008 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_4   (0x10U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_Pos) /*!< 0x00000010 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_5   (0x20U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B0_Pos) /*!< 0x00000020 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_Pos (8U)
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_Msk (0x3FU << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_Pos) /*!< 0x00003F00 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1     DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_Msk            /*!< Selects the HIF address bits used as bank address bit 1. */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_0   (0x1U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_Pos)  /*!< 0x00000100 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_1   (0x2U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_Pos)  /*!< 0x00000200 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_2   (0x4U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_Pos)  /*!< 0x00000400 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_3   (0x8U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_Pos)  /*!< 0x00000800 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_4   (0x10U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_Pos) /*!< 0x00001000 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_5   (0x20U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B1_Pos) /*!< 0x00002000 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_Pos (16U)
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_Msk (0x3FU << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_Pos) /*!< 0x003F0000 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2     DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_Msk            /*!< Selects the HIF address bit used as bank address bit 2. */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_0   (0x1U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_Pos)  /*!< 0x00010000 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_1   (0x2U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_Pos)  /*!< 0x00020000 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_2   (0x4U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_Pos)  /*!< 0x00040000 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_3   (0x8U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_Pos)  /*!< 0x00080000 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_4   (0x10U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_Pos) /*!< 0x00100000 */
#define DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_5   (0x20U << DDRCTRL_ADDRMAP1_ADDRMAP_BANK_B2_Pos) /*!< 0x00200000 */

/***************  Bit definition for DDRCTRL_ADDRMAP2 register  ***************/
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_Pos (0U)
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_Msk (0xFU << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_Pos) /*!< 0x0000000F */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2     DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_Msk           /*!< - Full bus width mode: Selects the HIF address bit used as column address bit 2. */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_0   (0x1U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_Pos) /*!< 0x00000001 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_1   (0x2U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_Pos) /*!< 0x00000002 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_2   (0x4U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_Pos) /*!< 0x00000004 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_3   (0x8U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B2_Pos) /*!< 0x00000008 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_Pos (8U)
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_Msk (0xFU << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_Pos) /*!< 0x00000F00 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3     DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_Msk           /*!< - Full bus width mode: Selects the HIF address bit used as column address bit 3. */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_0   (0x1U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_Pos) /*!< 0x00000100 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_1   (0x2U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_Pos) /*!< 0x00000200 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_2   (0x4U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_Pos) /*!< 0x00000400 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_3   (0x8U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B3_Pos) /*!< 0x00000800 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_Pos (16U)
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_Msk (0xFU << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_Pos) /*!< 0x000F0000 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4     DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_Msk           /*!< - Full bus width mode: Selects the HIF address bit used as column address bit 4. */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_0   (0x1U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_Pos) /*!< 0x00010000 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_1   (0x2U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_Pos) /*!< 0x00020000 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_2   (0x4U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_Pos) /*!< 0x00040000 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_3   (0x8U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B4_Pos) /*!< 0x00080000 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_Pos (24U)
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_Msk (0xFU << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_Pos) /*!< 0x0F000000 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5     DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_Msk           /*!< - Full bus width mode: Selects the HIF address bit used as column address bit 5. */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_0   (0x1U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_Pos) /*!< 0x01000000 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_1   (0x2U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_Pos) /*!< 0x02000000 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_2   (0x4U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_Pos) /*!< 0x04000000 */
#define DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_3   (0x8U << DDRCTRL_ADDRMAP2_ADDRMAP_COL_B5_Pos) /*!< 0x08000000 */

/***************  Bit definition for DDRCTRL_ADDRMAP3 register  ***************/
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_Pos (0U)
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_Msk (0xFU << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_Pos)  /*!< 0x0000000F */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6     DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_Msk            /*!< - Full bus width mode: Selects the HIF address bit used as column address bit 6. */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_0   (0x1U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_Pos)  /*!< 0x00000001 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_1   (0x2U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_Pos)  /*!< 0x00000002 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_2   (0x4U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_Pos)  /*!< 0x00000004 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_3   (0x8U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B6_Pos)  /*!< 0x00000008 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_Pos (8U)
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_Msk (0x1FU << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_Pos) /*!< 0x00001F00 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7     DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_Msk            /*!< - Full bus width mode: Selects the HIF address bit used as column address bit 7. */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_0   (0x1U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_Pos)  /*!< 0x00000100 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_1   (0x2U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_Pos)  /*!< 0x00000200 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_2   (0x4U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_Pos)  /*!< 0x00000400 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_3   (0x8U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_Pos)  /*!< 0x00000800 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_4   (0x10U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B7_Pos) /*!< 0x00001000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_Pos (16U)
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_Msk (0x1FU << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_Pos) /*!< 0x001F0000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8     DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_Msk            /*!< - Full bus width mode: Selects the HIF address bit used as column address bit 8. */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_0   (0x1U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_Pos)  /*!< 0x00010000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_1   (0x2U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_Pos)  /*!< 0x00020000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_2   (0x4U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_Pos)  /*!< 0x00040000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_3   (0x8U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_Pos)  /*!< 0x00080000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_4   (0x10U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B8_Pos) /*!< 0x00100000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_Pos (24U)
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_Msk (0x1FU << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_Pos) /*!< 0x1F000000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9     DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_Msk            /*!< - Full bus width mode: Selects the HIF address bit used as column address bit 9. */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_0   (0x1U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_Pos)  /*!< 0x01000000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_1   (0x2U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_Pos)  /*!< 0x02000000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_2   (0x4U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_Pos)  /*!< 0x04000000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_3   (0x8U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_Pos)  /*!< 0x08000000 */
#define DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_4   (0x10U << DDRCTRL_ADDRMAP3_ADDRMAP_COL_B9_Pos) /*!< 0x10000000 */

/***************  Bit definition for DDRCTRL_ADDRMAP4 register  ***************/
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_Pos (0U)
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_Msk (0x1FU << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_Pos) /*!< 0x0000001F */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10     DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_Msk            /*!< - Full bus width mode: Selects the HIF address bit used as column address bit 11 (10 in LPDDR2/LPDDR3 mode). */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_0   (0x1U << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_Pos)  /*!< 0x00000001 */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_1   (0x2U << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_Pos)  /*!< 0x00000002 */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_2   (0x4U << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_Pos)  /*!< 0x00000004 */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_3   (0x8U << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_Pos)  /*!< 0x00000008 */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_4   (0x10U << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B10_Pos) /*!< 0x00000010 */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_Pos (8U)
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_Msk (0x1FU << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_Pos) /*!< 0x00001F00 */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11     DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_Msk            /*!< - Full bus width mode: Selects the HIF address bit used as column address bit 13 (11 in LPDDR2/LPDDR3 mode). */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_0   (0x1U << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_Pos)  /*!< 0x00000100 */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_1   (0x2U << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_Pos)  /*!< 0x00000200 */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_2   (0x4U << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_Pos)  /*!< 0x00000400 */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_3   (0x8U << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_Pos)  /*!< 0x00000800 */
#define DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_4   (0x10U << DDRCTRL_ADDRMAP4_ADDRMAP_COL_B11_Pos) /*!< 0x00001000 */

