ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153fxx_ca7.h
/****************  Bit definition for RCC_ADCCKSELR register  *****************/
#define RCC_ADCCKSELR_ADCSRC_Pos                  (0U)
#define RCC_ADCCKSELR_ADCSRC_Msk                  (0x3U << RCC_ADCCKSELR_ADCSRC_Pos)                 /*!< 0x00000003 */
#define RCC_ADCCKSELR_ADCSRC                      RCC_ADCCKSELR_ADCSRC_Msk                           /*!< ADC1&amp;2 kernel clock source selection */
#define RCC_ADCCKSELR_ADCSRC_0                    (0x1U << RCC_ADCCKSELR_ADCSRC_Pos)                 /*!< 0x00000001 */
#define RCC_ADCCKSELR_ADCSRC_1                    (0x2U << RCC_ADCCKSELR_ADCSRC_Pos)                 /*!< 0x00000002 */

/**************  Bit definition for RCC_LPTIM45CKSELR register  ***************/
#define RCC_LPTIM45CKSELR_LPTIM45SRC_Pos          (0U)
#define RCC_LPTIM45CKSELR_LPTIM45SRC_Msk          (0x7U << RCC_LPTIM45CKSELR_LPTIM45SRC_Pos)         /*!< 0x00000007 */
#define RCC_LPTIM45CKSELR_LPTIM45SRC              RCC_LPTIM45CKSELR_LPTIM45SRC_Msk                   /*!< LPTIM4 and LPTIM5 kernel clock source selection */
#define RCC_LPTIM45CKSELR_LPTIM45SRC_0            (0x1U << RCC_LPTIM45CKSELR_LPTIM45SRC_Pos)         /*!< 0x00000001 */
#define RCC_LPTIM45CKSELR_LPTIM45SRC_1            (0x2U << RCC_LPTIM45CKSELR_LPTIM45SRC_Pos)         /*!< 0x00000002 */
#define RCC_LPTIM45CKSELR_LPTIM45SRC_2            (0x4U << RCC_LPTIM45CKSELR_LPTIM45SRC_Pos)         /*!< 0x00000004 */

/**************  Bit definition for RCC_LPTIM23CKSELR register  ***************/
#define RCC_LPTIM23CKSELR_LPTIM23SRC_Pos          (0U)
#define RCC_LPTIM23CKSELR_LPTIM23SRC_Msk          (0x7U << RCC_LPTIM23CKSELR_LPTIM23SRC_Pos)         /*!< 0x00000007 */
#define RCC_LPTIM23CKSELR_LPTIM23SRC              RCC_LPTIM23CKSELR_LPTIM23SRC_Msk                   /*!< LPTIM2 and LPTIM3 kernel clock source selection */
#define RCC_LPTIM23CKSELR_LPTIM23SRC_0            (0x1U << RCC_LPTIM23CKSELR_LPTIM23SRC_Pos)         /*!< 0x00000001 */
#define RCC_LPTIM23CKSELR_LPTIM23SRC_1            (0x2U << RCC_LPTIM23CKSELR_LPTIM23SRC_Pos)         /*!< 0x00000002 */
#define RCC_LPTIM23CKSELR_LPTIM23SRC_2            (0x4U << RCC_LPTIM23CKSELR_LPTIM23SRC_Pos)         /*!< 0x00000004 */

/***************  Bit definition for RCC_LPTIM1CKSELR register  ***************/
#define RCC_LPTIM1CKSELR_LPTIM1SRC_Pos            (0U)
#define RCC_LPTIM1CKSELR_LPTIM1SRC_Msk            (0x7U << RCC_LPTIM1CKSELR_LPTIM1SRC_Pos)           /*!< 0x00000007 */
#define RCC_LPTIM1CKSELR_LPTIM1SRC                RCC_LPTIM1CKSELR_LPTIM1SRC_Msk                     /*!< LPTIM1 kernel clock source selection */
#define RCC_LPTIM1CKSELR_LPTIM1SRC_0              (0x1U << RCC_LPTIM1CKSELR_LPTIM1SRC_Pos)           /*!< 0x00000001 */
#define RCC_LPTIM1CKSELR_LPTIM1SRC_1              (0x2U << RCC_LPTIM1CKSELR_LPTIM1SRC_Pos)           /*!< 0x00000002 */
#define RCC_LPTIM1CKSELR_LPTIM1SRC_2              (0x4U << RCC_LPTIM1CKSELR_LPTIM1SRC_Pos)           /*!< 0x00000004 */

/***************  Bit definition for RCC_APB1RSTSETR register  ****************/
#define RCC_APB1RSTSETR_TIM2RST_Pos               (0U)
#define RCC_APB1RSTSETR_TIM2RST_Msk               (0x1U << RCC_APB1RSTSETR_TIM2RST_Pos)              /*!< 0x00000001 */
#define RCC_APB1RSTSETR_TIM2RST                   RCC_APB1RSTSETR_TIM2RST_Msk                        /*!< TIM2 block reset */
#define RCC_APB1RSTSETR_TIM3RST_Pos               (1U)
#define RCC_APB1RSTSETR_TIM3RST_Msk               (0x1U << RCC_APB1RSTSETR_TIM3RST_Pos)              /*!< 0x00000002 */
#define RCC_APB1RSTSETR_TIM3RST                   RCC_APB1RSTSETR_TIM3RST_Msk                        /*!< TIM3 block reset */
#define RCC_APB1RSTSETR_TIM4RST_Pos               (2U)
#define RCC_APB1RSTSETR_TIM4RST_Msk               (0x1U << RCC_APB1RSTSETR_TIM4RST_Pos)              /*!< 0x00000004 */
#define RCC_APB1RSTSETR_TIM4RST                   RCC_APB1RSTSETR_TIM4RST_Msk                        /*!< TIM4 block reset */
#define RCC_APB1RSTSETR_TIM5RST_Pos               (3U)
#define RCC_APB1RSTSETR_TIM5RST_Msk               (0x1U << RCC_APB1RSTSETR_TIM5RST_Pos)              /*!< 0x00000008 */
#define RCC_APB1RSTSETR_TIM5RST                   RCC_APB1RSTSETR_TIM5RST_Msk                        /*!< TIM5 block reset */
#define RCC_APB1RSTSETR_TIM6RST_Pos               (4U)
#define RCC_APB1RSTSETR_TIM6RST_Msk               (0x1U << RCC_APB1RSTSETR_TIM6RST_Pos)              /*!< 0x00000010 */
#define RCC_APB1RSTSETR_TIM6RST                   RCC_APB1RSTSETR_TIM6RST_Msk                        /*!< TIM6 block reset */
#define RCC_APB1RSTSETR_TIM7RST_Pos               (5U)
#define RCC_APB1RSTSETR_TIM7RST_Msk               (0x1U << RCC_APB1RSTSETR_TIM7RST_Pos)              /*!< 0x00000020 */
#define RCC_APB1RSTSETR_TIM7RST                   RCC_APB1RSTSETR_TIM7RST_Msk                        /*!< TIM7 block reset */
#define RCC_APB1RSTSETR_TIM12RST_Pos              (6U)
#define RCC_APB1RSTSETR_TIM12RST_Msk              (0x1U << RCC_APB1RSTSETR_TIM12RST_Pos)             /*!< 0x00000040 */
#define RCC_APB1RSTSETR_TIM12RST                  RCC_APB1RSTSETR_TIM12RST_Msk                       /*!< TIM12 block reset */
#define RCC_APB1RSTSETR_TIM13RST_Pos              (7U)
#define RCC_APB1RSTSETR_TIM13RST_Msk              (0x1U << RCC_APB1RSTSETR_TIM13RST_Pos)             /*!< 0x00000080 */
#define RCC_APB1RSTSETR_TIM13RST                  RCC_APB1RSTSETR_TIM13RST_Msk                       /*!< TIM13 block reset */
#define RCC_APB1RSTSETR_TIM14RST_Pos              (8U)
#define RCC_APB1RSTSETR_TIM14RST_Msk              (0x1U << RCC_APB1RSTSETR_TIM14RST_Pos)             /*!< 0x00000100 */
#define RCC_APB1RSTSETR_TIM14RST                  RCC_APB1RSTSETR_TIM14RST_Msk                       /*!< TIM14 block reset */
#define RCC_APB1RSTSETR_LPTIM1RST_Pos             (9U)
#define RCC_APB1RSTSETR_LPTIM1RST_Msk             (0x1U << RCC_APB1RSTSETR_LPTIM1RST_Pos)            /*!< 0x00000200 */
#define RCC_APB1RSTSETR_LPTIM1RST                 RCC_APB1RSTSETR_LPTIM1RST_Msk                      /*!< LPTIM1 block reset */
#define RCC_APB1RSTSETR_SPI2RST_Pos               (11U)
#define RCC_APB1RSTSETR_SPI2RST_Msk               (0x1U << RCC_APB1RSTSETR_SPI2RST_Pos)              /*!< 0x00000800 */
#define RCC_APB1RSTSETR_SPI2RST                   RCC_APB1RSTSETR_SPI2RST_Msk                        /*!< SPI2 block reset */
#define RCC_APB1RSTSETR_SPI3RST_Pos               (12U)
#define RCC_APB1RSTSETR_SPI3RST_Msk               (0x1U << RCC_APB1RSTSETR_SPI3RST_Pos)              /*!< 0x00001000 */
#define RCC_APB1RSTSETR_SPI3RST                   RCC_APB1RSTSETR_SPI3RST_Msk                        /*!< SPI3 block reset */
#define RCC_APB1RSTSETR_USART2RST_Pos             (14U)
#define RCC_APB1RSTSETR_USART2RST_Msk             (0x1U << RCC_APB1RSTSETR_USART2RST_Pos)            /*!< 0x00004000 */
#define RCC_APB1RSTSETR_USART2RST                 RCC_APB1RSTSETR_USART2RST_Msk                      /*!< USART2 block reset */
#define RCC_APB1RSTSETR_USART3RST_Pos             (15U)
#define RCC_APB1RSTSETR_USART3RST_Msk             (0x1U << RCC_APB1RSTSETR_USART3RST_Pos)            /*!< 0x00008000 */
#define RCC_APB1RSTSETR_USART3RST                 RCC_APB1RSTSETR_USART3RST_Msk                      /*!< USART3 block reset */
#define RCC_APB1RSTSETR_UART4RST_Pos              (16U)
#define RCC_APB1RSTSETR_UART4RST_Msk              (0x1U << RCC_APB1RSTSETR_UART4RST_Pos)             /*!< 0x00010000 */
#define RCC_APB1RSTSETR_UART4RST                  RCC_APB1RSTSETR_UART4RST_Msk                       /*!< UART4 block reset */
#define RCC_APB1RSTSETR_UART5RST_Pos              (17U)
#define RCC_APB1RSTSETR_UART5RST_Msk              (0x1U << RCC_APB1RSTSETR_UART5RST_Pos)             /*!< 0x00020000 */
#define RCC_APB1RSTSETR_UART5RST                  RCC_APB1RSTSETR_UART5RST_Msk                       /*!< UART5 block reset */
#define RCC_APB1RSTSETR_UART7RST_Pos              (18U)
#define RCC_APB1RSTSETR_UART7RST_Msk              (0x1U << RCC_APB1RSTSETR_UART7RST_Pos)             /*!< 0x00040000 */
#define RCC_APB1RSTSETR_UART7RST                  RCC_APB1RSTSETR_UART7RST_Msk                       /*!< UART7 block reset */
#define RCC_APB1RSTSETR_UART8RST_Pos              (19U)
#define RCC_APB1RSTSETR_UART8RST_Msk              (0x1U << RCC_APB1RSTSETR_UART8RST_Pos)             /*!< 0x00080000 */
#define RCC_APB1RSTSETR_UART8RST                  RCC_APB1RSTSETR_UART8RST_Msk                       /*!< UART8 block reset */
#define RCC_APB1RSTSETR_I2C1RST_Pos               (21U)
#define RCC_APB1RSTSETR_I2C1RST_Msk               (0x1U << RCC_APB1RSTSETR_I2C1RST_Pos)              /*!< 0x00200000 */
#define RCC_APB1RSTSETR_I2C1RST                   RCC_APB1RSTSETR_I2C1RST_Msk                        /*!< I2C1 block reset */
#define RCC_APB1RSTSETR_I2C2RST_Pos               (22U)
#define RCC_APB1RSTSETR_I2C2RST_Msk               (0x1U << RCC_APB1RSTSETR_I2C2RST_Pos)              /*!< 0x00400000 */
#define RCC_APB1RSTSETR_I2C2RST                   RCC_APB1RSTSETR_I2C2RST_Msk                        /*!< I2C2 block reset */
#define RCC_APB1RSTSETR_I2C3RST_Pos               (23U)
#define RCC_APB1RSTSETR_I2C3RST_Msk               (0x1U << RCC_APB1RSTSETR_I2C3RST_Pos)              /*!< 0x00800000 */
#define RCC_APB1RSTSETR_I2C3RST                   RCC_APB1RSTSETR_I2C3RST_Msk                        /*!< I2C3 block reset */
#define RCC_APB1RSTSETR_I2C5RST_Pos               (24U)
#define RCC_APB1RSTSETR_I2C5RST_Msk               (0x1U << RCC_APB1RSTSETR_I2C5RST_Pos)              /*!< 0x01000000 */
#define RCC_APB1RSTSETR_I2C5RST                   RCC_APB1RSTSETR_I2C5RST_Msk                        /*!< I2C5 block reset */
#define RCC_APB1RSTSETR_SPDIFRST_Pos              (26U)
#define RCC_APB1RSTSETR_SPDIFRST_Msk              (0x1U << RCC_APB1RSTSETR_SPDIFRST_Pos)             /*!< 0x04000000 */
#define RCC_APB1RSTSETR_SPDIFRST                  RCC_APB1RSTSETR_SPDIFRST_Msk                       /*!< SPDIFRX block reset */
#define RCC_APB1RSTSETR_CECRST_Pos                (27U)
#define RCC_APB1RSTSETR_CECRST_Msk                (0x1U << RCC_APB1RSTSETR_CECRST_Pos)               /*!< 0x08000000 */
#define RCC_APB1RSTSETR_CECRST                    RCC_APB1RSTSETR_CECRST_Msk                         /*!< HDMI-CEC block reset */
#define RCC_APB1RSTSETR_DAC12RST_Pos              (29U)
#define RCC_APB1RSTSETR_DAC12RST_Msk              (0x1U << RCC_APB1RSTSETR_DAC12RST_Pos)             /*!< 0x20000000 */
#define RCC_APB1RSTSETR_DAC12RST                  RCC_APB1RSTSETR_DAC12RST_Msk                       /*!< DAC1&amp;2 block reset */
#define RCC_APB1RSTSETR_MDIOSRST_Pos              (31U)
#define RCC_APB1RSTSETR_MDIOSRST_Msk              (0x1U << RCC_APB1RSTSETR_MDIOSRST_Pos)             /*!< 0x80000000 */
#define RCC_APB1RSTSETR_MDIOSRST                  RCC_APB1RSTSETR_MDIOSRST_Msk                       /*!< MDIOS block reset */

